SanchousVedeneev/Lazurit_charger/PC-BPEiKU.ioc
FDCAN2.IPParameters=CalculateTimeQuantumNominal,CalculateTimeBitNominal,CalculateBaudRateNominal,DataPrescaler,DataTimeSeg1,DataTimeSeg2,StdFiltersNbr,NominalPrescaler,NominalTimeSeg1,NominalTimeSeg2,AutoRetransmission
FDCAN2.NominalPrescaler=_CAN_PSC
FDCAN2.NominalTimeSeg1=_CAN_SEG1
FDCAN2.NominalTimeSeg2=_CAN_SEG2
FDCAN2.StdFiltersNbr=1
File.Version=6
GPIO.groupedBy=Group By Peripherals
HRTIM1.CompareUnit1-No_output_TA=__NULL
HRTIM1.CompareUnit1-No_output_TB=__NULL
HRTIM1.IPParameters=CompareUnit1-No_output_TB,PrescalerRatio_TC,Periode_TC,ModeTimeBase-No_output_TC,UpDownMode-No_output_TC,PrescalerRatio_TA,Periode_TA,CompareUnit1-No_output_TA
HRTIM1.ModeTimeBase-No_output_TC=HRTIM_MODE_CONTINUOUS
HRTIM1.Periode_TA=21000
HRTIM1.Periode_TC=27999
HRTIM1.PrescalerRatio_TA=HRTIM_PRESCALERRATIO_DIV1
HRTIM1.PrescalerRatio_TC=HRTIM_PRESCALERRATIO_DIV1
HRTIM1.UpDownMode-No_output_TC=HRTIM_TIMERUPDOWNMODE_UP
I2C1.IPParameters=Timing
I2C1.Timing=0x60505F8C
KeepUserPlacement=false
Mcu.CPN=STM32G474VET6
Mcu.Family=STM32G4
Mcu.IP0=ADC1
Mcu.IP1=ADC2
Mcu.IP10=COMP6
Mcu.IP11=COMP7
Mcu.IP12=CORDIC
Mcu.IP13=DAC1
Mcu.IP14=DAC2
Mcu.IP15=DAC4
Mcu.IP16=DMA
Mcu.IP17=FDCAN1
Mcu.IP18=FDCAN2
Mcu.IP19=HRTIM1
Mcu.IP2=ADC3
Mcu.IP20=I2C1
Mcu.IP21=NVIC
Mcu.IP22=RCC
Mcu.IP23=SPI3
Mcu.IP24=SYS
Mcu.IP25=TIM2
Mcu.IP26=TIM3
Mcu.IP27=TIM17
Mcu.IP28=USART1
Mcu.IP29=USART3
Mcu.IP3=ADC4
Mcu.IP4=ADC5
Mcu.IP5=COMP1
Mcu.IP6=COMP2
Mcu.IP7=COMP3
Mcu.IP8=COMP4
Mcu.IP9=COMP5
Mcu.IPNb=30
Mcu.Name=STM32G474V(B-C-E)Tx
Mcu.Package=LQFP100
Mcu.Pin0=PF0-OSC_IN
Mcu.Pin1=PG10-NRST
Mcu.Pin10=PB0
Mcu.Pin11=PB1
Mcu.Pin12=PE7
Mcu.Pin13=PE8
Mcu.Pin14=PE9
Mcu.Pin15=PE11
Mcu.Pin16=PE12
Mcu.Pin17=PE13
Mcu.Pin18=PE14
Mcu.Pin19=PE15
Mcu.Pin2=PC1
Mcu.Pin20=PB10
Mcu.Pin21=PB11
Mcu.Pin22=PB12
Mcu.Pin23=PB13
Mcu.Pin24=PB14
Mcu.Pin25=PB15
Mcu.Pin26=PD8
Mcu.Pin27=PD11
Mcu.Pin28=PD12
Mcu.Pin29=PD14
Mcu.Pin3=PA0
Mcu.Pin30=PC6
Mcu.Pin31=PC7
Mcu.Pin32=PC8
Mcu.Pin33=PC9
Mcu.Pin34=PA8
Mcu.Pin35=PA9
Mcu.Pin36=PA10
Mcu.Pin37=PA11
Mcu.Pin38=PA13
Mcu.Pin39=PA14
Mcu.Pin4=PA1
Mcu.Pin40=PC10
Mcu.Pin41=PC11
Mcu.Pin42=PC12
Mcu.Pin43=PD0
Mcu.Pin44=PD1
Mcu.Pin45=PD4
Mcu.Pin46=PD6
Mcu.Pin47=PD7
Mcu.Pin48=PB3
Mcu.Pin49=PB4
Mcu.Pin5=PA2
Mcu.Pin50=PB5
Mcu.Pin51=PB6
Mcu.Pin52=PB8-BOOT0
Mcu.Pin53=PB9
Mcu.Pin54=PE0
Mcu.Pin55=PE1
Mcu.Pin56=VP_ADC5_TempSens_Input
Mcu.Pin57=VP_ADC5_Vref_Input
Mcu.Pin58=VP_COMP1_VS_DAC1OUT1
Mcu.Pin59=VP_COMP2_VS_DAC1OUT2
Mcu.Pin6=PA3
Mcu.Pin60=VP_COMP3_VS_DAC1OUT1
Mcu.Pin61=VP_COMP4_VS_DAC1OUT1
Mcu.Pin62=VP_COMP5_VS_DAC1OUT2
Mcu.Pin63=VP_COMP6_VS_DAC2OUT1
Mcu.Pin64=VP_COMP7_VS_DAC4OUT1
Mcu.Pin65=VP_CORDIC_VS_CORDIC
Mcu.Pin66=VP_DAC1_VS_DACI1
Mcu.Pin67=VP_DAC1_VS_DACI2
Mcu.Pin68=VP_DAC2_VS_DACI1
Mcu.Pin69=VP_DAC4_VS_DACI1
Mcu.Pin7=PA6
Mcu.Pin70=VP_DAC4_VS_DACI2
Mcu.Pin71=VP_HRTIM1_VS_hrtimTimerANoOutput
Mcu.Pin72=VP_HRTIM1_VS_hrtimTimerBNoOutput
Mcu.Pin73=VP_HRTIM1_VS_hrtimTimerCNoOutput
Mcu.Pin74=VP_HRTIM1_VS_hrtimTimerDNoOutput
Mcu.Pin75=VP_HRTIM1_VS_hrtimTimerENoOutput
Mcu.Pin76=VP_HRTIM1_VS_hrtimTimerFNoOutput
Mcu.Pin77=VP_SYS_VS_Systick
Mcu.Pin78=VP_SYS_VS_DBSignals
Mcu.Pin79=VP_TIM2_VS_ClockSourceINT
Mcu.Pin8=PA7
Mcu.Pin80=VP_TIM2_VS_no_output3
Mcu.Pin81=VP_TIM3_VS_ClockSourceINT
Mcu.Pin82=VP_TIM3_VS_no_output1
Mcu.Pin83=VP_TIM17_VS_ClockSourceINT
Mcu.Pin9=PC4
Mcu.PinsNb=84
Mcu.ThirdPartyNb=0
Mcu.UserConstants=_TIM1K_ARR,(16800-1);_CAN_PSC,_CAN_500_PSC;_TIM1K_PSC,(10-1);_HRTIM_PERIOD,10500;_CAN_SEG1,_CAN_500_SEG1;_LAMP_TIM_ARR,8400-1;_CAN_SEG2,_CAN_500_SEG2;_ADC_TIM,_ADC_TIM_24000;_CAN_500_PSC,21;_ADC_TIM_24000,(7000-1);_LED3_TIM_ARR,8400-1;_TIM10K_SPI_START,3000;_HRTIM_DT,300;_CAN_500_SEG1,13;_ADC_TIM_12800,(13125-1);_TIM10K_SPI_IN_E,15000;_CAN_500_SEG2,2;_TIM10K_SPI_ARR,(16800-1);_TIM10K_SPI_SOEN,1000;_TIM_SPI_INOUT_20KHZ_ARR,(20000-1);_TIM_SPI_INOUT_20KHZ_INE,1000;_TIM_SPI_INOUT_20KHZ_SOEN,(18000);_TIM_SPI_INOUT_20KHZ_START,1600
Mcu.UserName=STM32G474VETx
MxCube.Version=6.9.1
MxDb.Version=DB.6.0.91
NVIC.ADC3_IRQn=true\:3\:0\:true\:false\:false\:true\:false\:true
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.COMP1_2_3_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.COMP4_5_6_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.COMP7_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.DMA1_Channel1_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.DMA1_Channel2_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.DMA1_Channel3_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.DMA1_Channel5_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.DMA1_Channel6_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.DMA1_Channel7_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.ForceEnableDMAVector=true
NVIC.HRTIM1_TIMA_IRQn=true\:1\:0\:true\:false\:false\:true\:false\:true
NVIC.HRTIM1_TIMD_IRQn=true\:1\:0\:true\:false\:false\:true\:false\:true
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.SysTick_IRQn=true\:6\:0\:true\:false\:true\:false\:true\:false
NVIC.TIM1_TRG_COM_TIM17_IRQn=true\:4\:0\:true\:false\:false\:true\:false\:true
NVIC.TIM2_IRQn=true\:1\:0\:true\:false\:false\:true\:false\:true
NVIC.USART1_IRQn=true\:4\:0\:true\:false\:false\:true\:false\:true
NVIC.USART3_IRQn=true\:4\:0\:true\:false\:false\:true\:false\:true
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PA0.GPIOParameters=GPIO_Label
PA0.GPIO_Label=IA_A1
PA0.Locked=true
PA0.Mode=IN1-Single-Ended
PA0.Signal=ADC1_IN1
PA1.GPIOParameters=GPIO_Label
PA1.GPIO_Label=IA_A3
PA1.Locked=true
PA1.Mode=IN2-Single-Ended
PA1.Signal=ADC2_IN2
PA10.GPIOParameters=GPIO_Label
PA10.GPIO_Label=PWM_4H
PA10.Locked=true
PA10.Signal=HRTIM1_CHB1
PA11.GPIOParameters=GPIO_Label
PA11.GPIO_Label=PWM_4L
PA11.Locked=true
PA11.Signal=HRTIM1_CHB2
PA13.Locked=true
PA13.Mode=Serial_Wire
PA13.Signal=SYS_JTMS-SWDIO
PA14.Locked=true
PA14.Mode=Serial_Wire
PA14.Signal=SYS_JTCK-SWCLK
PA2.GPIOParameters=GPIO_Label
PA2.GPIO_Label=IA_A7
PA2.Locked=true
PA2.Mode=IN3-Single-Ended
PA2.Signal=ADC1_IN3
PA3.GPIOParameters=GPIO_Label
PA3.GPIO_Label=IA_A2
PA3.Locked=true
PA3.Mode=IN4-Single-Ended
PA3.Signal=ADC1_IN4
PA6.GPIOParameters=GPIO_Label
PA6.GPIO_Label=IA_A9
PA6.Locked=true
PA6.Mode=IN3-Single-Ended
PA6.Signal=ADC2_IN3
PA7.GPIOParameters=GPIO_Label
PA7.GPIO_Label=COMP_I2
PA7.Mode=INP
PA7.Signal=COMP2_INP
PA8.GPIOParameters=GPIO_Label
PA8.GPIO_Label=PWM_6H
PA8.Locked=true
PA8.Signal=HRTIM1_CHA1
PA9.GPIOParameters=GPIO_Label
PA9.GPIO_Label=PWM_6L
PA9.Locked=true
PA9.Signal=HRTIM1_CHA2
PB0.GPIOParameters=GPIO_Label
PB0.GPIO_Label=COMP_I3
PB0.Mode=INP
PB0.Signal=COMP4_INP
PB1.GPIOParameters=GPIO_Label
PB1.GPIO_Label=COMP_I4
PB1.Mode=INP
PB1.Signal=COMP1_INP
PB10.GPIOParameters=GPIO_Label
PB10.GPIO_Label=O_D_Led_Link
PB10.Locked=true
PB10.Signal=GPIO_Output
PB11.GPIOParameters=GPIO_Label
PB11.GPIO_Label=O_D_Led_Ready
PB11.Locked=true
PB11.Signal=GPIO_Output
PB12.GPIOParameters=GPIO_Label
PB12.GPIO_Label=PWM_2H
PB12.Locked=true
PB12.Signal=HRTIM1_CHC1
PB13.GPIOParameters=GPIO_Label
PB13.GPIO_Label=PWM_2L
PB13.Locked=true
PB13.Signal=HRTIM1_CHC2
PB14.GPIOParameters=GPIO_Label
PB14.GPIO_Label=PWM_3H
PB14.Locked=true
PB14.Signal=HRTIM1_CHD1
PB15.GPIOParameters=GPIO_Label
PB15.GPIO_Label=PWM_3L
PB15.Locked=true
PB15.Signal=HRTIM1_CHD2
PB3.Locked=true
PB3.Mode=Full_Duplex_Master
PB3.Signal=SPI3_SCK
PB4.Locked=true
PB4.Mode=Full_Duplex_Master
PB4.Signal=SPI3_MISO
PB5.Locked=true
PB5.Mode=FDCAN_Activate
PB5.Signal=FDCAN2_RX
PB6.Locked=true
PB6.Mode=FDCAN_Activate
PB6.Signal=FDCAN2_TX
PB8-BOOT0.Locked=true
PB8-BOOT0.Mode=I2C
PB8-BOOT0.Signal=I2C1_SCL
PB9.Locked=true
PB9.Mode=I2C
PB9.Signal=I2C1_SDA
PC1.GPIOParameters=GPIO_Label
PC1.GPIO_Label=COMP_I1
PC1.Mode=INP
PC1.Signal=COMP3_INP
PC10.Locked=true
PC10.Mode=Asynchronous
PC10.Signal=USART3_TX
PC11.GPIOParameters=GPIO_PuPd
PC11.GPIO_PuPd=GPIO_PULLDOWN
PC11.Locked=true
PC11.Mode=Asynchronous
PC11.Signal=USART3_RX
PC12.Locked=true
PC12.Mode=Full_Duplex_Master
PC12.Signal=SPI3_MOSI
PC4.GPIOParameters=GPIO_Label
PC4.GPIO_Label=IA_A4
PC4.Mode=IN5-Single-Ended
PC4.Signal=ADC2_IN5
PC6.GPIOParameters=GPIO_Label
PC6.GPIO_Label=PWM_1H
PC6.Locked=true
PC6.Signal=HRTIM1_CHF1
PC7.GPIOParameters=GPIO_Label
PC7.GPIO_Label=PWM_1L
PC7.Locked=true
PC7.Signal=HRTIM1_CHF2
PC8.GPIOParameters=GPIO_Label
PC8.GPIO_Label=PWM_5H
PC8.Locked=true
PC8.Signal=HRTIM1_CHE1
PC9.GPIOParameters=GPIO_Label
PC9.GPIO_Label=PWM_5L
PC9.Locked=true
PC9.Signal=HRTIM1_CHE2
PD0.Locked=true
PD0.Mode=FDCAN_Activate
PD0.Signal=FDCAN1_RX
PD1.Locked=true
PD1.Mode=FDCAN_Activate
PD1.Signal=FDCAN1_TX
PD11.GPIOParameters=GPIO_Label
PD11.GPIO_Label=COMP_I6
PD11.Locked=true
PD11.Mode=INP
PD11.Signal=COMP6_INP
PD12.GPIOParameters=GPIO_Label
PD12.GPIO_Label=COMP_I5
PD12.Mode=INP
PD12.Signal=COMP5_INP
PD14.GPIOParameters=GPIO_Label
PD14.GPIO_Label=COMP_U3
PD14.Mode=INP
PD14.Signal=COMP7_INP
PD4.GPIOParameters=GPIO_Label
PD4.GPIO_Label=O_T_SPI_IN_E
PD4.Locked=true
PD4.Signal=S_TIM2_CH2
PD6.GPIOParameters=GPIO_Label
PD6.GPIO_Label=O_T_SPI_SOEN
PD6.Locked=true
PD6.Signal=S_TIM2_CH4
PD7.GPIOParameters=GPIO_Label
PD7.GPIO_Label=O_D_SPI_SR
PD7.Locked=true
PD7.Signal=GPIO_Output
PD8.GPIOParameters=GPIO_Label
PD8.GPIO_Label=O_D_Led_Fault
PD8.Locked=true
PD8.Signal=GPIO_Output
PE0.Mode=Asynchronous
PE0.Signal=USART1_TX
PE1.Locked=true
PE1.Mode=Asynchronous
PE1.Signal=USART1_RX
PE11.GPIOParameters=GPIO_Label
PE11.GPIO_Label=IA_TEMP1
PE11.Locked=true
PE11.Mode=IN15-Single-Ended
PE11.Signal=ADC5_IN15
PE12.GPIOParameters=GPIO_Label
PE12.GPIO_Label=IA_TEMP2
PE12.Locked=true
PE12.Mode=IN16-Single-Ended
PE12.Signal=ADC5_IN16
PE13.GPIOParameters=GPIO_Label
PE13.GPIO_Label=IA_A5
PE13.Mode=IN3-Single-Ended
PE13.Signal=ADC3_IN3
PE14.GPIOParameters=GPIO_Label
PE14.GPIO_Label=IA_A11(ext)
PE14.Mode=IN1-Single-Ended
PE14.Signal=ADC4_IN1
PE15.GPIOParameters=GPIO_Label
PE15.GPIO_Label=IA_A12(ext)
PE15.Mode=IN2-Single-Ended
PE15.Signal=ADC4_IN2
PE7.GPIOParameters=GPIO_Label
PE7.GPIO_Label=IA_A10
PE7.Locked=true
PE7.Mode=IN4-Single-Ended
PE7.Signal=ADC3_IN4
PE8.GPIOParameters=GPIO_Label
PE8.GPIO_Label=IA_A8(ext)
PE8.Mode=IN6-Single-Ended
PE8.Signal=ADC4_IN6
PE9.GPIOParameters=GPIO_Label
PE9.GPIO_Label=IA_A6
PE9.Locked=true
PE9.Mode=IN2-Single-Ended
PE9.Signal=ADC3_IN2
PF0-OSC_IN.Locked=true
PF0-OSC_IN.Mode=HSE-External-Clock-Source
PF0-OSC_IN.Signal=RCC_OSC_IN
PG10-NRST.GPIOParameters=GPIO_Label
PG10-NRST.GPIO_Label=NRST
PG10-NRST.Locked=true
PG10-NRST.Signal=GPIO_Input
PinOutPanel.RotationAngle=0
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.CompilerOptimize=6
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=true
ProjectManager.CustomerFirmwarePackage=..\\..\\..\\prog\\CubeMX\\Repository\\STM32Cube_FW_G4_V1.5.1
ProjectManager.DefaultFWLocation=false
ProjectManager.DeletePrevious=false
ProjectManager.DeviceId=STM32G474VETx
ProjectManager.FirmwarePackage=STM32Cube FW_G4 V1.5.1
ProjectManager.FreePins=false
ProjectManager.HalAssertFull=false
ProjectManager.HeapSize=0x1000
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=true
ProjectManager.LibraryCopy=1
ProjectManager.MainLocation=Core/Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=PC-BPEiKU.ioc
ProjectManager.ProjectName=PC-BPEiKU
ProjectManager.ProjectStructure=
ProjectManager.RegisterCallBack=
ProjectManager.StackSize=0x2000
ProjectManager.TargetToolchain=Makefile
ProjectManager.ToolChainLocation=
ProjectManager.UAScriptAfterPath=
ProjectManager.UAScriptBeforePath=
ProjectManager.UnderRoot=false
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-LL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_DMA_Init-DMA-false-HAL-true,4-MX_FDCAN1_Init-FDCAN1-false-HAL-true,5-MX_USART3_UART_Init-USART3-false-HAL-true,6-MX_ADC2_Init-ADC2-false-LL-true,7-MX_ADC3_Init-ADC3-false-LL-true,8-MX_CORDIC_Init-CORDIC-false-LL-true,9-MX_ADC1_Init-ADC1-false-LL-true,10-MX_ADC5_Init-ADC5-false-LL-true,11-MX_DAC1_Init-DAC1-false-HAL-true,12-MX_FDCAN2_Init-FDCAN2-false-HAL-true,13-MX_COMP3_Init-COMP3-false-HAL-true,14-MX_I2C1_Init-I2C1-false-HAL-true,15-MX_USART1_UART_Init-USART1-false-HAL-true,16-MX_ADC4_Init-ADC4-false-LL-true,17-MX_COMP1_Init-COMP1-false-HAL-true,18-MX_COMP2_Init-COMP2-false-HAL-true,19-MX_COMP4_Init-COMP4-false-HAL-true,20-MX_COMP5_Init-COMP5-false-HAL-true,21-MX_COMP6_Init-COMP6-false-HAL-true,22-MX_COMP7_Init-COMP7-false-HAL-true,23-MX_DAC2_Init-DAC2-false-HAL-true,24-MX_DAC4_Init-DAC4-false-HAL-true,25-MX_TIM17_Init-TIM17-false-HAL-true,26-MX_SPI3_Init-SPI3-false-HAL-true,27-MX_TIM2_Init-TIM2-false-HAL-true,28-MX_TIM3_Init-TIM3-false-HAL-true,29-MX_HRTIM1_Init-HRTIM1-false-LL-true
RCC.ADC12Freq_Value=168000000
RCC.ADC345Freq_Value=168000000
RCC.AHBFreq_Value=168000000
RCC.APB1Freq_Value=168000000
RCC.APB1TimFreq_Value=168000000
RCC.APB2Freq_Value=168000000
RCC.APB2TimFreq_Value=168000000
RCC.CRSFreq_Value=48000000
RCC.CortexFreq_Value=168000000
RCC.EXTERNAL_CLOCK_VALUE=12288000
RCC.FCLKCortexFreq_Value=168000000
RCC.FDCANFreq_Value=168000000
RCC.FLatency=FLASH_LATENCY_4
RCC.FamilyName=M
RCC.HCLKFreq_Value=168000000
RCC.HSE_VALUE=16000000
RCC.HSI48_VALUE=48000000
RCC.HSICalibrationValue=16
RCC.HSI_VALUE=16000000
RCC.I2C1Freq_Value=168000000
RCC.I2C2Freq_Value=168000000
RCC.I2C3Freq_Value=168000000
RCC.I2C4Freq_Value=168000000
RCC.I2SFreq_Value=168000000
RCC.IPParameters=ADC12Freq_Value,ADC345Freq_Value,AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,CRSFreq_Value,CortexFreq_Value,EXTERNAL_CLOCK_VALUE,FCLKCortexFreq_Value,FDCANFreq_Value,FLatency,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI48_VALUE,HSICalibrationValue,HSI_VALUE,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,I2C4Freq_Value,I2SFreq_Value,LPTIM1Freq_Value,LPUART1Freq_Value,LSCOPinFreq_Value,LSE_VALUE,LSI_VALUE,MCO1PinFreq_Value,PLLN,PLLPoutputFreq_Value,PLLQoutputFreq_Value,PLLRCLKFreq_Value,PLLSourceVirtual,PWRFreq_Value,PWR_Regulator_Voltage_Scale,QSPIFreq_Value,RNGFreq_Value,SAI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,UART4Freq_Value,UART5Freq_Value,USART1Freq_Value,USART2Freq_Value,USART3Freq_Value,USBFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value
RCC.LPTIM1Freq_Value=168000000
RCC.LPUART1Freq_Value=168000000
RCC.LSCOPinFreq_Value=32000
RCC.LSE_VALUE=32768
RCC.LSI_VALUE=32000
RCC.MCO1PinFreq_Value=16000000
RCC.PLLN=21
RCC.PLLPoutputFreq_Value=168000000
RCC.PLLQoutputFreq_Value=168000000
RCC.PLLRCLKFreq_Value=168000000
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
RCC.PWRFreq_Value=168000000
RCC.PWR_Regulator_Voltage_Scale=PWR_REGULATOR_VOLTAGE_SCALE1_BOOST
RCC.QSPIFreq_Value=168000000
RCC.RNGFreq_Value=168000000
RCC.SAI1Freq_Value=168000000
RCC.SYSCLKFreq_VALUE=168000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.UART4Freq_Value=168000000
RCC.UART5Freq_Value=168000000
RCC.USART1Freq_Value=168000000
RCC.USART2Freq_Value=168000000
RCC.USART3Freq_Value=168000000
RCC.USBFreq_Value=168000000
RCC.VCOInputFreq_Value=16000000
RCC.VCOOutputFreq_Value=336000000
SH.S_TIM2_CH2.0=TIM2_CH2,PWM Generation2 CH2
SH.S_TIM2_CH2.ConfNb=1
SH.S_TIM2_CH4.0=TIM2_CH4,PWM Generation4 CH4
SH.S_TIM2_CH4.ConfNb=1
SPI3.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_256
SPI3.CLKPhase=SPI_PHASE_1EDGE
SPI3.CalculateBaudRate=656.25 KBits/s
SPI3.DataSize=SPI_DATASIZE_8BIT
SPI3.Direction=SPI_DIRECTION_2LINES
SPI3.IPParameters=VirtualType,Mode,Direction,BaudRatePrescaler,CalculateBaudRate,DataSize,CLKPhase
SPI3.Mode=SPI_MODE_MASTER
SPI3.VirtualType=VM_MASTER
TIM17.IPParameters=Prescaler,PeriodNoDither
TIM17.PeriodNoDither=_TIM1K_ARR
TIM17.Prescaler=_TIM1K_PSC
TIM2.Channel-Output\ Compare3\ No\ Output=TIM_CHANNEL_3
TIM2.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
TIM2.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
TIM2.CounterMode=TIM_COUNTERMODE_UP
TIM2.IPParameters=Channel-PWM Generation4 CH4,Channel-PWM Generation2 CH2,Prescaler,PeriodNoDither,Channel-Output Compare3 No Output,OCPolarity_4,PulseNoDither_4,PulseNoDither_2,PulseNoDither_3,OCPolarity_2,CounterMode
TIM2.OCPolarity_2=TIM_OCPOLARITY_LOW
TIM2.OCPolarity_4=TIM_OCPOLARITY_LOW
TIM2.PeriodNoDither=_TIM_SPI_INOUT_20KHZ_ARR
TIM2.Prescaler=0
TIM2.PulseNoDither_2=_TIM_SPI_INOUT_20KHZ_INE
TIM2.PulseNoDither_3=_TIM_SPI_INOUT_20KHZ_START
TIM2.PulseNoDither_4=_TIM_SPI_INOUT_20KHZ_SOEN
TIM3.Channel-Output\ Compare1\ No\ Output=TIM_CHANNEL_1
TIM3.IPParameters=TIM_MasterOutputTrigger,Channel-Output Compare1 No Output,PeriodNoDither,PulseNoDither_1
TIM3.PeriodNoDither=_ADC_TIM
TIM3.PulseNoDither_1=(_ADC_TIM/2)
TIM3.TIM_MasterOutputTrigger=TIM_TRGO_UPDATE
USART1.IPParameters=VirtualMode-Asynchronous
USART1.VirtualMode-Asynchronous=VM_ASYNC
USART3.AutoBaudRateEnableParam=UART_ADVFEATURE_AUTOBAUDRATE_DISABLE
USART3.BaudRate=115200
USART3.ClockPrescaler=PRESCALER_DIV1
USART3.DMADisableonRxErrorParam=ADVFEATURE_DMA_ENABLEONRXERROR
USART3.DataInvertParam=ADVFEATURE_DATAINV_DISABLE
USART3.FIFOMode=FIFOMODE_DISABLE
USART3.IPParameters=BaudRate,WordLength,Parity,StopBits,Mode,OverSampling,OneBitSampling,ClockPrescaler,FIFOMode,TXFIFOThreshold,RXFIFOThreshold,AutoBaudRateEnableParam,TxPinLevelInvertParam,RxPinLevelInvertParam,DataInvertParam,SwapParam,OverrunDisableParam,DMADisableonRxErrorParam,MSBFirstParam,VirtualMode-Asynchronous
USART3.MSBFirstParam=ADVFEATURE_MSBFIRST_DISABLE
USART3.Mode=MODE_TX_RX
USART3.OneBitSampling=UART_ONE_BIT_SAMPLE_DISABLE
USART3.OverSampling=UART_OVERSAMPLING_16
USART3.OverrunDisableParam=ADVFEATURE_OVERRUN_ENABLE
USART3.Parity=PARITY_NONE
USART3.RXFIFOThreshold=RXFIFO_THRESHOLD_1EIGHTHFULL
USART3.RxPinLevelInvertParam=ADVFEATURE_RXINV_DISABLE
